
// №1: Гра Вгадай число
// Напишіть невеличку гру, яка за допомогою браузерної команди prompt() буде запитувати користувача ввести будь-яке число. Далі потрібно перевірити:

// Якщо число більше або дорівнює 123 - програма зупиняється, виводячи текстове повідомлення Wow, you've ended this endless cycle!;
// Якщо введене число менше від 123 - вивести текстове Should continue та продовжувати запитувати користувача про введення далі;
// Якщо користувач ввів не числове значення - вивести текстове повідомлення Only numbers, please та знову запитувати ввести значення.


  let n= +prompt("Введіть будь-яке число:");
  while (isNaN(n) || n < 123) {
    if (!isNaN(n)) {
        n= +prompt('Should continue');
    } else {
        n= +prompt('Only numbers, please');
    }
  }
  alert("Wow, you've ended this endless cycle!");