// 1. Пошук максимального числа
// Написати функцію, яка на вхід отримує масив чисел довільного порядку (не сортовані) та довільної довжини з N елементів, та повертає значення найменшого числа в цьому масиві. Для спрощення рішення розуміємо, що на вхід отримуємо масив, що завжди складається тільки з чисел. Якщо заданий масив пустий (немає жодного елементу) - повернути null. Використовувати будь-які вбудовані функції заборонено, тільки власний код!
// Приклади роботи: (вхідні дані -> результат роботи функції)
// [1, 7, 5, 6, 0] -> 0
// [3, 1, -9, -3, 2, 8] -> -9

// Підказка: потрібно перебрати весь масив.
// Додаткове питання: що треба змінити в функції, аби замість мінімального значення вона шукала максимальне? А якщо одразу шукати і мінімальне, і максимальне значення?

function getMaxAndMin(array) {
        if (array.length === 0) {
            return null;
        }

        let maxNumber = array[0];
        let minNumber = array[0];

        for (let i = 0; i < array.length; i++) {
            if (array[i] > maxNumber) {
                maxNumber = array[i];
            }

            if (array[i] < minNumber) {
                minNumber = array[i];
            }
        }
        return `maxNumber = ${maxNumber}, minNumber = ${minNumber}`;
    }

    alert(getMaxAndMin([1, 7, 5, 6, 0] )); //maxNumber = 7, minNumber = 0
    alert(getMaxAndMin([3, 1, -9, -3, 2, 8] )); //maxNumber = 8, minNumber = -9
    alert(getMaxAndMin([] )); //null