// №2 Сума та добуток діапазону чисел
// За допомогою браузерної команди prompt() почергово запросити у користувача 2 різних числа. В залежності від того, що ввів користувач:

// Якщо будь-яке введене значення не є числом - повторити запит на введення даних з текстом Only numbers, please;
// Якщо обидва значення числові - вивести добуток всіх парних чисел та суму всіх не парних чисел у заданому діапазоні. Діапазон - числа між значеннями, що їх ввів користувач, включаючи самі значення. Вивід відформатувати з використанням повідомлень Сума = {значення суми} та Добуток = {значення добутку} (фігурні дужки самі по собі не потрібні, тут лиш для відображення форматування).
// Приклади:

// Введено значення 5 та 15, результат роботи програми: Сума = 60 (5 + 7 + 9 + 11 + 13 + 15), Добуток = 80640 (6 * 8 * 10 * 12 * 14)
// Введено значення 20 та 7, результат роботи програми: Сума = 91 (7 + 9 + 11 + 13 + 15 + 17 + 19), Добуток = 77414400 (8 * 10 * 12 * 14 * 16 * 18 * 20)


let n1;
let n2;
let firstn;
let lastn;
let sum = 0;
let mult = 1;

while(isNaN(n1) || isNaN(n2)) {
  if (isNaN(n1)) {
    n1 = +prompt("Only numbers, please (n1)");
} if (isNaN(n2)) {
  n2 = +prompt("Only numbers, please (n2)");
} }
firstn = n1 < n2 ? n1 : n2;
lastn = n1 > n2 ? n1 + 1 : n2 + 1;
sum = 0;
mult = 1;
for (let x = firstn; x < lastn; x++) {
  if (x % 2 === 0) {
      mult = mult * x;
  } else {
      sum = sum + x;
  }
}
alert(sum);
alert(mult);